src/Catalogs/ЗадачиМетеор/ЗадачиМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачиМетеор</name>
  <attributes>
    <name>id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>project_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>EnumRef.ВидыЗадачМетеор</types>
    </type>
  </attributes>
  <attributes>
    <name>Срочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>idv3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>project_idv3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.МеткиМетеор</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ЗадачиМетеор/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбновитьДанныеИзМетеора() Экспорт
	
	ДанныеМетеор = ИнтеграцияСМетеор.ПолучитьДанныеЗадачиИзМетеор(ЭтотОбъект);
	Если ДанныеМетеор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеМетеор,,"Метки");
	
	Метки.Очистить();
	Для Каждого Метка Из ДанныеМетеор.Метки Цикл
		НовСтр = Метки.Добавить();
		НовСтр.Метка = Справочники.МеткиМетеор.НайтиСоздатьМетку(Метка);
		НовСтр.Комментарий = Метка.Комментарий;
	КонецЦикла;
	Срочная = Метки.Найти(Справочники.МеткиМетеор.Срочное,"Метка") <> Неопределено;
	
КонецПроцедуры 

#КонецОбласти
